0.1.0/tutorials/incompressible/simple/pitz_daily/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            fixedValue;
    value           uniform 0;
  }
  upperWall
  {
    type            zeroGradient;
  }
  lowerWall
  {
    type            zeroGradient;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
