0.1.0/tutorials/incompressible/simple/pitz_daily/0/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 440.15;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           $internalField;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            omegaWallFunction;
    value           $internalField;
  }
  lowerWall
  {
    type            omegaWallFunction;
    value           $internalField;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
