0.1.0/tutorials/incompressible/simple/pitz_daily/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
  }
  "(U|k|epsilon|omega|f|v2)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  consistent      yes;
  residualControl
  {
    p               1e-2;
    U               1e-3;
    "(k|epsilon|omega|f|v2)" 1e-3;
  }
}
relaxationFactors
{
  equations
  {
    U               0.9; // 0.9 is more stable but 0.95 more convergent
    ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
